# Data Wrangling 
* Handle missing values
* Data Formating
* Data Normalization
   * Centeralizing
   * Scalling
* Data Binning
* Making Dummies of catergorical  data 
   * catergorical ---> Numerical

In [2]:
# libraries 
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
ship = sns.load_dataset('titanic')
ship.isnull().sum()
Sp2 = ship

In [4]:
ship.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [5]:
ship.shape
ship = ship.dropna()
ship.shape
ship.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [6]:
# use .dropna method

ship.dropna(subset=['deck'], axis=0, inplace=True)
ship.dropna(subset=['age'], axis=0, inplace=True)
ship.dropna(subset=['embark_town'], axis=0, inplace=True)
ship.dropna(subset=['embarked'], axis=0, inplace=True)

C:\Users\muham\AppData\Local\Temp\ipykernel_10764\590141111.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ship.dropna(subset=['deck'], axis=0, inplace=True)
C:\Users\muham\AppData\Local\Temp\ipykernel_10764\590141111.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ship.dropna(subset=['age'], axis=0, inplace=True)
C:\Users\muham\AppData\Local\Temp\ipykernel_10764\590141111.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ship.dropna(subset=['embark_town'], axis=0, inplace=True)
C:\Users\muham\AppData\Local\Temp\ipykernel_10764\590141111.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ship.dropna(subset=['embarked'], axis=0, inplace=True)

In [7]:
ship.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [8]:
ship.shape

(182, 15)

In [9]:
mean = Sp2["age"].mean()
mean

29.69911764705882

In [10]:
Sp2["age"] = Sp2["age"].replace(np.nan, mean)
Sp2.isnull().sum()

survived         0
pclass           0
sex              0
age              0
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [16]:
# to view data types of columns
ship.dtypes
# to change data type of any column
ship['survived'] = ship["survived"].astype("float64")
ship['age'] = ship["age"].astype("int64")
ship.dtypes

C:\Users\muham\AppData\Local\Temp\ipykernel_10764\2321197162.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ship['survived'] = ship["survived"].astype("float64")
C:\Users\muham\AppData\Local\Temp\ipykernel_10764\2321197162.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ship['age'] = ship["age"].astype("int64")

survived        float64
pclass            int64
sex              object
age               int64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [38]:
Sp2['age'] = Sp2['age'].astype("int64")
Sp3 = Sp2.dropna()
Sp3

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [41]:
Sp3["age"] = Sp3["age"] * 365

Sp3["age"].head()

C:\Users\muham\AppData\Local\Temp\ipykernel_10764\3779562337.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Sp3["age"] = Sp3["age"] * 365

1     13870
3     12775
6     19710
10     1460
11    21170
Name: age, dtype: int64

In [42]:
# always rename the afterwards
Sp3.rename(columns={"age":"age in days"},inplace=True)
Sp3

C:\Users\muham\AppData\Local\Temp\ipykernel_10764\925772997.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Sp3.rename(columns={"age":"age in days"},inplace=True)

,survived,pclass,sex,age in days,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,13870,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,12775,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,19710,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,1460,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,21170,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,17155,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,12045,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,20440,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,6935,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,9490,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

# Data Normalization
* Uniform hte data
* they have same impack
* A fish in jar or A fish in sea
* Also for computational reasons

# Method of Normalization
1. Simple Feature scalling
   * x(new) = x(old)/x(max)
2. Min - Max method
3. Z-score (standard score) -3 -to- +3
4. Log transformation

In [58]:
Sp4 = Sp3[["age in days","fare"]]
Sp5 = Sp3[["age in days","fare"]]
Sp6 = Sp3[["age in days","fare"]]
Sp7 = Sp3[["age in days","fare"]]
Sp4.head()

    age in days     fare
1         13870  71.2833
3         12775  53.1000
6         19710  51.8625
10         1460  16.7000
11        21170  26.5500

In [47]:
# Simple feature scalling
Sp4['fare'] = Sp4['fare']/ Sp4['fare'].max()
Sp4['age in days'] = Sp4['age in days']/ Sp4['age in days'].max()
Sp4.head()

C:\Users\muham\AppData\Local\Temp\ipykernel_10764\3595910509.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Sp4['fare'] = Sp4['fare']/ Sp4['fare'].max()
C:\Users\muham\AppData\Local\Temp\ipykernel_10764\3595910509.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Sp4['age in days'] = Sp4['age in days']/ Sp4['age in days'].max()

    age in days      fare
1        0.4750  0.139136
3        0.4375  0.103644
6        0.6750  0.101229
10       0.0500  0.032596
11       0.7250  0.051822

In [50]:
# Min - Max  method
Sp5.head()
Sp5['fare'] = (Sp5['fare']-Sp5['fare'].min())/(Sp5['fare'].max()-Sp5['fare'].min())
Sp5.head()

C:\Users\muham\AppData\Local\Temp\ipykernel_10764\1938308749.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Sp5['fare'] = (Sp5['fare']-Sp5['fare'].min())/(Sp5['fare'].max()-Sp5['fare'].min())

    age in days      fare
1         13870  0.139136
3         12775  0.103644
6         19710  0.101229
10         1460  0.032596
11        21170  0.051822

In [57]:
# Z score
Sp6['fare'] = (Sp6['fare']-Sp6['fare'].mean())/Sp6['fare'].std()
Sp6['fare'].head()

C:\Users\muham\AppData\Local\Temp\ipykernel_10764\271145284.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Sp6['fare'] = (Sp6['fare']-Sp6['fare'].mean())/Sp6['fare'].std()

1    -0.067057
3    -0.309853
6    -0.326377
10   -0.795891
11   -0.664367
Name: fare, dtype: float64

In [60]:
# log method
Sp7['fare'] = np.log(Sp7['fare'])
Sp7.head()

c:\Python311\Lib\site-packages\pandas\core\arraylike.py:396: RuntimeWarning: invalid value encountered in log
  result = getattr(ufunc, method)(*inputs, **kwargs)
C:\Users\muham\AppData\Local\Temp\ipykernel_10764\2147545700.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Sp7['fare'] = np.log(Sp7['fare'])

    age in days      fare
1         13870  1.450832
3         12775  1.379314
6         19710  1.373360
10         1460  1.035107
11        21170  1.187548

# Binning
* Divid persons based on persons

In [69]:
pd.get_dummies(ship['sex'])

ship[ship["sex"]== 1]

Empty DataFrame
Columns: [survived, pclass, sex, age, sibsp, parch, fare, embarked, class, who, adult_male, deck, embark_town, alive, alone]
Index: []